Model: "sequential_14"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_42 (Conv2D)           (None, 62, 214, 32)       320       
_________________________________________________________________
max_pooling2d_42 (MaxPooling (None, 31, 107, 32)       0         
_________________________________________________________________
batch_normalization_42 (Batc (None, 31, 107, 32)       128       
_________________________________________________________________
conv2d_43 (Conv2D)           (None, 29, 105, 32)       9248      
_________________________________________________________________
max_pooling2d_43 (MaxPooling (None, 15, 53, 32)        0         
_________________________________________________________________
batch_normalization_43 (Batc (None, 15, 53, 32)        128       
_________________________________________________________________
conv2d_44 (Conv2D)           (None, 14, 52, 32)        4128      
_________________________________________________________________
max_pooling2d_44 (MaxPooling (None, 7, 26, 32)         0         
_________________________________________________________________
batch_normalization_44 (Batc (None, 7, 26, 32)         128       
_________________________________________________________________
flatten_14 (Flatten)         (None, 5824)              0         
_________________________________________________________________
dense_43 (Dense)             (None, 64)                372800    
_________________________________________________________________
dropout_29 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_44 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_30 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_45 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_31 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_46 (Dense)             (None, 10)                170       
=================================================================
Total params: 389,658
Trainable params: 389,466
Non-trainable params: 192
_________________________________________________________________
