Model: "sequential_11"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_33 (Conv2D)           (None, 62, 85, 32)        320       
_________________________________________________________________
max_pooling2d_33 (MaxPooling (None, 31, 43, 32)        0         
_________________________________________________________________
batch_normalization_33 (Batc (None, 31, 43, 32)        128       
_________________________________________________________________
conv2d_34 (Conv2D)           (None, 29, 41, 32)        9248      
_________________________________________________________________
max_pooling2d_34 (MaxPooling (None, 15, 21, 32)        0         
_________________________________________________________________
batch_normalization_34 (Batc (None, 15, 21, 32)        128       
_________________________________________________________________
conv2d_35 (Conv2D)           (None, 14, 20, 32)        4128      
_________________________________________________________________
max_pooling2d_35 (MaxPooling (None, 7, 10, 32)         0         
_________________________________________________________________
batch_normalization_35 (Batc (None, 7, 10, 32)         128       
_________________________________________________________________
flatten_11 (Flatten)         (None, 2240)              0         
_________________________________________________________________
dense_31 (Dense)             (None, 64)                143424    
_________________________________________________________________
dropout_20 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_32 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_21 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_33 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_22 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_34 (Dense)             (None, 10)                170       
=================================================================
Total params: 160,282
Trainable params: 160,090
Non-trainable params: 192
_________________________________________________________________
