Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_6 (Conv2D)            (None, 64, 87, 64)        1088      
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 32, 43, 64)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 32, 43, 32)        32800     
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 16, 21, 32)        0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 10752)             0         
_________________________________________________________________
dense_6 (Dense)              (None, 64)                688192    
_________________________________________________________________
dropout_4 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_7 (Dense)              (None, 32)                2080      
_________________________________________________________________
dropout_5 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_8 (Dense)              (None, 10)                330       
=================================================================
Total params: 724,490
Trainable params: 724,490
Non-trainable params: 0
_________________________________________________________________
