Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_21 (Conv2D)           (None, 62, 85, 32)        320       
_________________________________________________________________
max_pooling2d_21 (MaxPooling (None, 31, 43, 32)        0         
_________________________________________________________________
batch_normalization_21 (Batc (None, 31, 43, 32)        128       
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 29, 41, 32)        9248      
_________________________________________________________________
max_pooling2d_22 (MaxPooling (None, 15, 21, 32)        0         
_________________________________________________________________
batch_normalization_22 (Batc (None, 15, 21, 32)        128       
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 14, 20, 32)        4128      
_________________________________________________________________
max_pooling2d_23 (MaxPooling (None, 7, 10, 32)         0         
_________________________________________________________________
batch_normalization_23 (Batc (None, 7, 10, 32)         128       
_________________________________________________________________
flatten_7 (Flatten)          (None, 2240)              0         
_________________________________________________________________
dense_15 (Dense)             (None, 64)                143424    
_________________________________________________________________
dropout_8 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_16 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_9 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_17 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_10 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_18 (Dense)             (None, 10)                170       
=================================================================
Total params: 160,282
Trainable params: 160,090
Non-trainable params: 192
_________________________________________________________________
