Model: "sequential_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_27 (Conv2D)           (None, 62, 85, 32)        320       
_________________________________________________________________
max_pooling2d_27 (MaxPooling (None, 31, 43, 32)        0         
_________________________________________________________________
batch_normalization_27 (Batc (None, 31, 43, 32)        128       
_________________________________________________________________
conv2d_28 (Conv2D)           (None, 29, 41, 32)        9248      
_________________________________________________________________
max_pooling2d_28 (MaxPooling (None, 15, 21, 32)        0         
_________________________________________________________________
batch_normalization_28 (Batc (None, 15, 21, 32)        128       
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 14, 20, 32)        4128      
_________________________________________________________________
max_pooling2d_29 (MaxPooling (None, 7, 10, 32)         0         
_________________________________________________________________
batch_normalization_29 (Batc (None, 7, 10, 32)         128       
_________________________________________________________________
flatten_9 (Flatten)          (None, 2240)              0         
_________________________________________________________________
dense_23 (Dense)             (None, 64)                143424    
_________________________________________________________________
dropout_14 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_24 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_15 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_25 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_16 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_26 (Dense)             (None, 10)                170       
=================================================================
Total params: 160,282
Trainable params: 160,090
Non-trainable params: 192
_________________________________________________________________
