Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_12 (Conv2D)           (None, 62, 85, 32)        320       
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 31, 43, 32)        0         
_________________________________________________________________
batch_normalization_12 (Batc (None, 31, 43, 32)        128       
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 29, 41, 32)        9248      
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 15, 21, 32)        0         
_________________________________________________________________
batch_normalization_13 (Batc (None, 15, 21, 32)        128       
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 14, 20, 32)        4128      
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 7, 10, 32)         0         
_________________________________________________________________
batch_normalization_14 (Batc (None, 7, 10, 32)         128       
_________________________________________________________________
flatten_4 (Flatten)          (None, 2240)              0         
_________________________________________________________________
dense_8 (Dense)              (None, 64)                143424    
_________________________________________________________________
dropout_4 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_9 (Dense)              (None, 10)                650       
=================================================================
Total params: 158,154
Trainable params: 157,962
Non-trainable params: 192
_________________________________________________________________
