Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_18 (Conv2D)           (None, 62, 171, 32)       320       
_________________________________________________________________
max_pooling2d_18 (MaxPooling (None, 31, 86, 32)        0         
_________________________________________________________________
batch_normalization_18 (Batc (None, 31, 86, 32)        128       
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 29, 84, 32)        9248      
_________________________________________________________________
max_pooling2d_19 (MaxPooling (None, 15, 42, 32)        0         
_________________________________________________________________
batch_normalization_19 (Batc (None, 15, 42, 32)        128       
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 14, 41, 32)        4128      
_________________________________________________________________
max_pooling2d_20 (MaxPooling (None, 7, 21, 32)         0         
_________________________________________________________________
batch_normalization_20 (Batc (None, 7, 21, 32)         128       
_________________________________________________________________
flatten_6 (Flatten)          (None, 4704)              0         
_________________________________________________________________
dense_24 (Dense)             (None, 64)                301120    
_________________________________________________________________
dropout_18 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_25 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_19 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_26 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_20 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_27 (Dense)             (None, 10)                170       
=================================================================
Total params: 317,978
Trainable params: 317,786
Non-trainable params: 192
_________________________________________________________________
