Model: "sequential_12"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_35 (Conv2D)           (None, 64, 87, 64)        1088      
_________________________________________________________________
max_pooling2d_35 (MaxPooling (None, 32, 43, 64)        0         
_________________________________________________________________
conv2d_36 (Conv2D)           (None, 32, 43, 64)        65600     
_________________________________________________________________
max_pooling2d_36 (MaxPooling (None, 16, 21, 64)        0         
_________________________________________________________________
conv2d_37 (Conv2D)           (None, 16, 21, 32)        32800     
_________________________________________________________________
max_pooling2d_37 (MaxPooling (None, 8, 10, 32)         0         
_________________________________________________________________
dropout_32 (Dropout)         (None, 8, 10, 32)         0         
_________________________________________________________________
flatten_12 (Flatten)         (None, 2560)              0         
_________________________________________________________________
dense_35 (Dense)             (None, 64)                163904    
_________________________________________________________________
dropout_33 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_36 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_34 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_37 (Dense)             (None, 10)                330       
=================================================================
Total params: 265,802
Trainable params: 265,802
Non-trainable params: 0
_________________________________________________________________
