Model: "sequential_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_27 (Conv2D)           (None, 64, 87, 64)        1088      
_________________________________________________________________
max_pooling2d_27 (MaxPooling (None, 32, 43, 64)        0         
_________________________________________________________________
dropout_36 (Dropout)         (None, 32, 43, 64)        0         
_________________________________________________________________
conv2d_28 (Conv2D)           (None, 32, 43, 64)        65600     
_________________________________________________________________
max_pooling2d_28 (MaxPooling (None, 16, 21, 64)        0         
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 16, 21, 32)        32800     
_________________________________________________________________
max_pooling2d_29 (MaxPooling (None, 8, 10, 32)         0         
_________________________________________________________________
dropout_37 (Dropout)         (None, 8, 10, 32)         0         
_________________________________________________________________
flatten_9 (Flatten)          (None, 2560)              0         
_________________________________________________________________
dense_27 (Dense)             (None, 64)                163904    
_________________________________________________________________
dropout_38 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_28 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_39 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_29 (Dense)             (None, 10)                330       
=================================================================
Total params: 265,802
Trainable params: 265,802
Non-trainable params: 0
_________________________________________________________________
