Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_3 (Conv2D)            (None, 62, 85, 32)        320       
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 31, 43, 32)        0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 31, 43, 32)        128       
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 29, 41, 32)        9248      
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 15, 21, 32)        0         
_________________________________________________________________
batch_normalization_4 (Batch (None, 15, 21, 32)        128       
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 14, 20, 32)        4128      
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 7, 10, 32)         0         
_________________________________________________________________
batch_normalization_5 (Batch (None, 7, 10, 32)         128       
_________________________________________________________________
flatten_1 (Flatten)          (None, 2240)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 64)                143424    
_________________________________________________________________
dropout_1 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 10)                650       
=================================================================
Total params: 158,154
Trainable params: 157,962
Non-trainable params: 192
_________________________________________________________________
