Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_15 (Conv2D)           (None, 64, 87, 64)        1088      
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 32, 43, 64)        0         
_________________________________________________________________
dropout_20 (Dropout)         (None, 32, 43, 64)        0         
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 32, 43, 64)        65600     
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 16, 21, 64)        0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 16, 21, 32)        32800     
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 8, 10, 32)         0         
_________________________________________________________________
dropout_21 (Dropout)         (None, 8, 10, 32)         0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 2560)              0         
_________________________________________________________________
dense_15 (Dense)             (None, 64)                163904    
_________________________________________________________________
dropout_22 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_16 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_23 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_17 (Dense)             (None, 10)                330       
=================================================================
Total params: 265,802
Trainable params: 265,802
Non-trainable params: 0
_________________________________________________________________
