Model: "sequential_11"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_32 (Conv2D)           (None, 64, 87, 64)        1088      
_________________________________________________________________
max_pooling2d_32 (MaxPooling (None, 32, 43, 64)        0         
_________________________________________________________________
conv2d_33 (Conv2D)           (None, 32, 43, 64)        65600     
_________________________________________________________________
max_pooling2d_33 (MaxPooling (None, 16, 21, 64)        0         
_________________________________________________________________
conv2d_34 (Conv2D)           (None, 16, 21, 32)        32800     
_________________________________________________________________
max_pooling2d_34 (MaxPooling (None, 8, 10, 32)         0         
_________________________________________________________________
dropout_29 (Dropout)         (None, 8, 10, 32)         0         
_________________________________________________________________
flatten_11 (Flatten)         (None, 2560)              0         
_________________________________________________________________
dense_32 (Dense)             (None, 64)                163904    
_________________________________________________________________
dropout_30 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_33 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_31 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_34 (Dense)             (None, 10)                330       
=================================================================
Total params: 265,802
Trainable params: 265,802
Non-trainable params: 0
_________________________________________________________________
