Model: "sequential_12"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_36 (Conv2D)           (None, 62, 128, 32)       320       
_________________________________________________________________
max_pooling2d_36 (MaxPooling (None, 31, 64, 32)        0         
_________________________________________________________________
batch_normalization_36 (Batc (None, 31, 64, 32)        128       
_________________________________________________________________
conv2d_37 (Conv2D)           (None, 29, 62, 32)        9248      
_________________________________________________________________
max_pooling2d_37 (MaxPooling (None, 15, 31, 32)        0         
_________________________________________________________________
batch_normalization_37 (Batc (None, 15, 31, 32)        128       
_________________________________________________________________
conv2d_38 (Conv2D)           (None, 14, 30, 32)        4128      
_________________________________________________________________
max_pooling2d_38 (MaxPooling (None, 7, 15, 32)         0         
_________________________________________________________________
batch_normalization_38 (Batc (None, 7, 15, 32)         128       
_________________________________________________________________
flatten_12 (Flatten)         (None, 3360)              0         
_________________________________________________________________
dense_35 (Dense)             (None, 64)                215104    
_________________________________________________________________
dropout_23 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_36 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_24 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_37 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_25 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_38 (Dense)             (None, 10)                170       
=================================================================
Total params: 231,962
Trainable params: 231,770
Non-trainable params: 192
_________________________________________________________________
