Model: "sequential_15"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_45 (Conv2D)           (None, 62, 214, 32)       320       
_________________________________________________________________
max_pooling2d_45 (MaxPooling (None, 31, 107, 32)       0         
_________________________________________________________________
batch_normalization_45 (Batc (None, 31, 107, 32)       128       
_________________________________________________________________
conv2d_46 (Conv2D)           (None, 29, 105, 32)       9248      
_________________________________________________________________
max_pooling2d_46 (MaxPooling (None, 15, 53, 32)        0         
_________________________________________________________________
batch_normalization_46 (Batc (None, 15, 53, 32)        128       
_________________________________________________________________
conv2d_47 (Conv2D)           (None, 14, 52, 32)        4128      
_________________________________________________________________
max_pooling2d_47 (MaxPooling (None, 7, 26, 32)         0         
_________________________________________________________________
batch_normalization_47 (Batc (None, 7, 26, 32)         128       
_________________________________________________________________
flatten_15 (Flatten)         (None, 5824)              0         
_________________________________________________________________
dense_47 (Dense)             (None, 64)                372800    
_________________________________________________________________
dropout_32 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_48 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_33 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_49 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_34 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_50 (Dense)             (None, 10)                170       
=================================================================
Total params: 389,658
Trainable params: 389,466
Non-trainable params: 192
_________________________________________________________________
