Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_24 (Conv2D)           (None, 62, 85, 32)        320       
_________________________________________________________________
max_pooling2d_24 (MaxPooling (None, 31, 43, 32)        0         
_________________________________________________________________
batch_normalization_24 (Batc (None, 31, 43, 32)        128       
_________________________________________________________________
conv2d_25 (Conv2D)           (None, 29, 41, 32)        9248      
_________________________________________________________________
max_pooling2d_25 (MaxPooling (None, 15, 21, 32)        0         
_________________________________________________________________
batch_normalization_25 (Batc (None, 15, 21, 32)        128       
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 14, 20, 32)        4128      
_________________________________________________________________
max_pooling2d_26 (MaxPooling (None, 7, 10, 32)         0         
_________________________________________________________________
batch_normalization_26 (Batc (None, 7, 10, 32)         128       
_________________________________________________________________
flatten_8 (Flatten)          (None, 2240)              0         
_________________________________________________________________
dense_19 (Dense)             (None, 64)                143424    
_________________________________________________________________
dropout_11 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_20 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_12 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_21 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_13 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_22 (Dense)             (None, 10)                170       
=================================================================
Total params: 160,282
Trainable params: 160,090
Non-trainable params: 192
_________________________________________________________________
