Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_15 (Conv2D)           (None, 62, 171, 32)       320       
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 31, 86, 32)        0         
_________________________________________________________________
batch_normalization_15 (Batc (None, 31, 86, 32)        128       
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 29, 84, 32)        9248      
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 15, 42, 32)        0         
_________________________________________________________________
batch_normalization_16 (Batc (None, 15, 42, 32)        128       
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 14, 41, 32)        4128      
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 7, 21, 32)         0         
_________________________________________________________________
batch_normalization_17 (Batc (None, 7, 21, 32)         128       
_________________________________________________________________
flatten_5 (Flatten)          (None, 4704)              0         
_________________________________________________________________
dense_20 (Dense)             (None, 64)                301120    
_________________________________________________________________
dropout_15 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_21 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_16 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_22 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_17 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_23 (Dense)             (None, 10)                170       
=================================================================
Total params: 317,978
Trainable params: 317,786
Non-trainable params: 192
_________________________________________________________________
