Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_3 (Conv2D)            (None, 64, 87, 64)        1088      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 32, 43, 64)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 32, 43, 64)        65600     
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 16, 21, 64)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 16, 21, 32)        32800     
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 8, 10, 32)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 2560)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 64)                163904    
_________________________________________________________________
dropout_2 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 32)                2080      
_________________________________________________________________
dropout_3 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 10)                330       
=================================================================
Total params: 265,802
Trainable params: 265,802
Non-trainable params: 0
_________________________________________________________________
