Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_8 (Conv2D)            (None, 64, 87, 64)        1088      
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 32, 43, 64)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 32, 43, 64)        65600     
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 16, 21, 64)        0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 16, 21, 32)        32800     
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 8, 10, 32)         0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 2560)              0         
_________________________________________________________________
dense_9 (Dense)              (None, 32)                81952     
_________________________________________________________________
dropout_6 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_10 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_7 (Dropout)          (None, 16)                0         
_________________________________________________________________
dense_11 (Dense)             (None, 10)                170       
=================================================================
Total params: 182,138
Trainable params: 182,138
Non-trainable params: 0
_________________________________________________________________
