Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_12 (Conv2D)           (None, 64, 87, 64)        1088      
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 32, 43, 64)        0         
_________________________________________________________________
dropout_16 (Dropout)         (None, 32, 43, 64)        0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 32, 43, 64)        65600     
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 16, 21, 64)        0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 16, 21, 32)        32800     
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 8, 10, 32)         0         
_________________________________________________________________
dropout_17 (Dropout)         (None, 8, 10, 32)         0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 2560)              0         
_________________________________________________________________
dense_12 (Dense)             (None, 64)                163904    
_________________________________________________________________
dropout_18 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_13 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_19 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_14 (Dense)             (None, 10)                330       
=================================================================
Total params: 265,802
Trainable params: 265,802
Non-trainable params: 0
_________________________________________________________________
