Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_18 (Conv2D)           (None, 62, 85, 32)        320       
_________________________________________________________________
max_pooling2d_18 (MaxPooling (None, 31, 43, 32)        0         
_________________________________________________________________
batch_normalization_18 (Batc (None, 31, 43, 32)        128       
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 29, 41, 32)        9248      
_________________________________________________________________
max_pooling2d_19 (MaxPooling (None, 15, 21, 32)        0         
_________________________________________________________________
batch_normalization_19 (Batc (None, 15, 21, 32)        128       
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 14, 20, 32)        4128      
_________________________________________________________________
max_pooling2d_20 (MaxPooling (None, 7, 10, 32)         0         
_________________________________________________________________
batch_normalization_20 (Batc (None, 7, 10, 32)         128       
_________________________________________________________________
flatten_6 (Flatten)          (None, 2240)              0         
_________________________________________________________________
dense_12 (Dense)             (None, 64)                143424    
_________________________________________________________________
dropout_6 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_13 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_7 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_14 (Dense)             (None, 10)                330       
=================================================================
Total params: 159,914
Trainable params: 159,722
Non-trainable params: 192
_________________________________________________________________
