Model: "sequential_16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_48 (Conv2D)           (None, 62, 214, 32)       320       
_________________________________________________________________
max_pooling2d_48 (MaxPooling (None, 31, 107, 32)       0         
_________________________________________________________________
batch_normalization_48 (Batc (None, 31, 107, 32)       128       
_________________________________________________________________
conv2d_49 (Conv2D)           (None, 29, 105, 32)       9248      
_________________________________________________________________
max_pooling2d_49 (MaxPooling (None, 15, 53, 32)        0         
_________________________________________________________________
batch_normalization_49 (Batc (None, 15, 53, 32)        128       
_________________________________________________________________
conv2d_50 (Conv2D)           (None, 14, 52, 32)        4128      
_________________________________________________________________
max_pooling2d_50 (MaxPooling (None, 7, 26, 32)         0         
_________________________________________________________________
batch_normalization_50 (Batc (None, 7, 26, 32)         128       
_________________________________________________________________
flatten_16 (Flatten)         (None, 5824)              0         
_________________________________________________________________
dense_51 (Dense)             (None, 64)                372800    
_________________________________________________________________
dropout_35 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_52 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_36 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_53 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_37 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_54 (Dense)             (None, 10)                170       
=================================================================
Total params: 389,658
Trainable params: 389,466
Non-trainable params: 192
_________________________________________________________________
