Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_24 (Conv2D)           (None, 64, 216, 64)       1088      
_________________________________________________________________
max_pooling2d_24 (MaxPooling (None, 32, 108, 64)       0         
_________________________________________________________________
dropout_32 (Dropout)         (None, 32, 108, 64)       0         
_________________________________________________________________
conv2d_25 (Conv2D)           (None, 32, 108, 64)       65600     
_________________________________________________________________
max_pooling2d_25 (MaxPooling (None, 16, 54, 64)        0         
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 16, 54, 32)        32800     
_________________________________________________________________
max_pooling2d_26 (MaxPooling (None, 8, 27, 32)         0         
_________________________________________________________________
dropout_33 (Dropout)         (None, 8, 27, 32)         0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 6912)              0         
_________________________________________________________________
dense_24 (Dense)             (None, 64)                442432    
_________________________________________________________________
dropout_34 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_25 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_35 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_26 (Dense)             (None, 10)                330       
=================================================================
Total params: 544,330
Trainable params: 544,330
Non-trainable params: 0
_________________________________________________________________
