Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_15 (Conv2D)           (None, 62, 85, 32)        320       
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 31, 43, 32)        0         
_________________________________________________________________
batch_normalization_15 (Batc (None, 31, 43, 32)        128       
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 29, 41, 32)        9248      
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 15, 21, 32)        0         
_________________________________________________________________
batch_normalization_16 (Batc (None, 15, 21, 32)        128       
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 14, 20, 32)        4128      
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 7, 10, 32)         0         
_________________________________________________________________
batch_normalization_17 (Batc (None, 7, 10, 32)         128       
_________________________________________________________________
flatten_5 (Flatten)          (None, 2240)              0         
_________________________________________________________________
dense_10 (Dense)             (None, 32)                71712     
_________________________________________________________________
dropout_5 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_11 (Dense)             (None, 10)                330       
=================================================================
Total params: 86,122
Trainable params: 85,930
Non-trainable params: 192
_________________________________________________________________
