Model: "sequential_13"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_38 (Conv2D)           (None, 64, 87, 64)        1088      
_________________________________________________________________
max_pooling2d_38 (MaxPooling (None, 32, 43, 64)        0         
_________________________________________________________________
conv2d_39 (Conv2D)           (None, 32, 43, 64)        65600     
_________________________________________________________________
max_pooling2d_39 (MaxPooling (None, 16, 21, 64)        0         
_________________________________________________________________
conv2d_40 (Conv2D)           (None, 16, 21, 32)        32800     
_________________________________________________________________
max_pooling2d_40 (MaxPooling (None, 8, 10, 32)         0         
_________________________________________________________________
dropout_35 (Dropout)         (None, 8, 10, 32)         0         
_________________________________________________________________
flatten_13 (Flatten)         (None, 2560)              0         
_________________________________________________________________
dense_38 (Dense)             (None, 64)                163904    
_________________________________________________________________
dropout_36 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_39 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_37 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_40 (Dense)             (None, 10)                330       
=================================================================
Total params: 265,802
Trainable params: 265,802
Non-trainable params: 0
_________________________________________________________________
