Model: "sequential_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_30 (Conv2D)           (None, 30, 85, 32)        320       
_________________________________________________________________
max_pooling2d_30 (MaxPooling (None, 15, 43, 32)        0         
_________________________________________________________________
batch_normalization_30 (Batc (None, 15, 43, 32)        128       
_________________________________________________________________
conv2d_31 (Conv2D)           (None, 13, 41, 32)        9248      
_________________________________________________________________
max_pooling2d_31 (MaxPooling (None, 7, 21, 32)         0         
_________________________________________________________________
batch_normalization_31 (Batc (None, 7, 21, 32)         128       
_________________________________________________________________
conv2d_32 (Conv2D)           (None, 6, 20, 32)         4128      
_________________________________________________________________
max_pooling2d_32 (MaxPooling (None, 3, 10, 32)         0         
_________________________________________________________________
batch_normalization_32 (Batc (None, 3, 10, 32)         128       
_________________________________________________________________
flatten_10 (Flatten)         (None, 960)               0         
_________________________________________________________________
dense_27 (Dense)             (None, 64)                61504     
_________________________________________________________________
dropout_17 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_28 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_18 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_29 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_19 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_30 (Dense)             (None, 10)                170       
=================================================================
Total params: 78,362
Trainable params: 78,170
Non-trainable params: 192
_________________________________________________________________
