Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 64, 173, 64)       1088      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 32, 86, 64)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 32, 86, 64)        65600     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 16, 43, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 16, 43, 32)        32800     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 8, 21, 32)         0         
_________________________________________________________________
flatten (Flatten)            (None, 5376)              0         
_________________________________________________________________
dense (Dense)                (None, 64)                344128    
_________________________________________________________________
dropout (Dropout)            (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                2080      
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 10)                330       
=================================================================
Total params: 446,026
Trainable params: 446,026
Non-trainable params: 0
_________________________________________________________________
