Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 62, 171, 32)       320       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 31, 86, 32)        0         
_________________________________________________________________
batch_normalization (BatchNo (None, 31, 86, 32)        128       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 29, 84, 32)        9248      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 15, 42, 32)        0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 15, 42, 32)        128       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 41, 32)        4128      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 7, 21, 32)         0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 7, 21, 32)         128       
_________________________________________________________________
flatten (Flatten)            (None, 4704)              0         
_________________________________________________________________
dense (Dense)                (None, 64)                301120    
_________________________________________________________________
dropout (Dropout)            (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                2080      
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 16)                528       
_________________________________________________________________
dropout_2 (Dropout)          (None, 16)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 10)                170       
=================================================================
Total params: 317,978
Trainable params: 317,786
Non-trainable params: 192
_________________________________________________________________
