Model: "sequential_13"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_39 (Conv2D)           (None, 62, 171, 32)       320       
_________________________________________________________________
max_pooling2d_39 (MaxPooling (None, 31, 86, 32)        0         
_________________________________________________________________
batch_normalization_39 (Batc (None, 31, 86, 32)        128       
_________________________________________________________________
conv2d_40 (Conv2D)           (None, 29, 84, 32)        9248      
_________________________________________________________________
max_pooling2d_40 (MaxPooling (None, 15, 42, 32)        0         
_________________________________________________________________
batch_normalization_40 (Batc (None, 15, 42, 32)        128       
_________________________________________________________________
conv2d_41 (Conv2D)           (None, 14, 41, 32)        4128      
_________________________________________________________________
max_pooling2d_41 (MaxPooling (None, 7, 21, 32)         0         
_________________________________________________________________
batch_normalization_41 (Batc (None, 7, 21, 32)         128       
_________________________________________________________________
flatten_13 (Flatten)         (None, 4704)              0         
_________________________________________________________________
dense_39 (Dense)             (None, 64)                301120    
_________________________________________________________________
dropout_26 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_40 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_27 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_41 (Dense)             (None, 16)                528       
_________________________________________________________________
dropout_28 (Dropout)         (None, 16)                0         
_________________________________________________________________
dense_42 (Dense)             (None, 10)                170       
=================================================================
Total params: 317,978
Trainable params: 317,786
Non-trainable params: 192
_________________________________________________________________
