Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 62, 85, 32)        320       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 31, 43, 32)        0         
_________________________________________________________________
batch_normalization (BatchNo (None, 31, 43, 32)        128       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 29, 41, 32)        9248      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 15, 21, 32)        0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 15, 21, 32)        128       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 14, 20, 32)        4128      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 7, 10, 32)         0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 7, 10, 32)         128       
_________________________________________________________________
flatten (Flatten)            (None, 2240)              0         
_________________________________________________________________
dense (Dense)                (None, 64)                143424    
_________________________________________________________________
dropout (Dropout)            (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 10)                650       
=================================================================
Total params: 158,154
Trainable params: 157,962
Non-trainable params: 192
_________________________________________________________________
