Model: "sequential_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_30 (Conv2D)           (None, 64, 173, 64)       1088      
_________________________________________________________________
max_pooling2d_30 (MaxPooling (None, 32, 86, 64)        0         
_________________________________________________________________
dropout_40 (Dropout)         (None, 32, 86, 64)        0         
_________________________________________________________________
conv2d_31 (Conv2D)           (None, 32, 86, 64)        65600     
_________________________________________________________________
max_pooling2d_31 (MaxPooling (None, 16, 43, 64)        0         
_________________________________________________________________
conv2d_32 (Conv2D)           (None, 16, 43, 32)        32800     
_________________________________________________________________
max_pooling2d_32 (MaxPooling (None, 8, 21, 32)         0         
_________________________________________________________________
dropout_41 (Dropout)         (None, 8, 21, 32)         0         
_________________________________________________________________
flatten_10 (Flatten)         (None, 5376)              0         
_________________________________________________________________
dense_30 (Dense)             (None, 64)                344128    
_________________________________________________________________
dropout_42 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_31 (Dense)             (None, 32)                2080      
_________________________________________________________________
dropout_43 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_32 (Dense)             (None, 10)                330       
=================================================================
Total params: 446,026
Trainable params: 446,026
Non-trainable params: 0
_________________________________________________________________
